{
  "name": "sequential_11",
  "trainable": true,
  "dtype": {
    "module": "keras",
    "class_name": "DTypePolicy",
    "config": {
      "name": "float32"
    },
    "registered_name": null
  },
  "layers": [
    {
      "module": "keras.layers",
      "class_name": "InputLayer",
      "config": {
        "batch_shape": [
          null,
          4
        ],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "input_layer_11",
        "optional": false
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_55",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 128,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          4
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_56",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 64,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          128
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_57",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 32,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          64
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_58",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 32,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          32
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_59",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 1,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          32
        ]
      }
    }
  ],
  "build_input_shape": [
    null,
    4
  ]
}